/**
 * Name commonMsg.js
 * Description	공통 메세지
 * Modification Information
 */

/*************************************************************
* 작성자 : 최정석
* 작성날짜 : 2025.08.08
* 내용 : 로그인 관련
**************************************************************/	
var loginFailMsg 			= '아이디 또는 비밀번호를 다시 확인해주세요.';
var loginDistinct 			= '현재 다른곳에서 로그인되어 있습니다. 여기서 로그인 하시겠습니까?';

var logOutFailMsg 		= '로그아웃을 다시 진행해주세요.';
var sessionLogOutMsg 	= '세션이 만료되어 로그아웃됩니다.';

/*************************************************************
* 작성자 : 최정석
* 작성날짜 : 2025.08.08
* 내용 : 등록, 수정, 삭제 관련
**************************************************************/	
var dataEmpty 		= '를(을) 입력해주세요.';
var dataChk 			= '를(을) 확인해주세요.';

var selectDataChk 	= '조회할 데이터를 선택해주세요.';
var updDataChk 		= '수정할 데이터를 선택해주세요.';
var delDataChk 		= '삭제할 데이터를 선택해주세요.';

var regProcConfirm	= '를(을) 저장하시겠습니까?';
var updProcConfirm 	= '를(을) 수정하시겠습니까?';
var delProcConfirm 	= '를(을) 삭제하시겠습니까?';

/*************************************************************
* 작성자 : 최정석
* 작성날짜 : 2025.08.08
* 내용 : 관리자 > 메뉴관리
**************************************************************/	

var menuNmChk = '동일한 메뉴명을 사용중입니다.'

/*************************************************************
* 작성자 : 최정석
* 작성날짜 : 2025.08.08
* 내용 : 관리자 > 코드관리
**************************************************************/	

var commGroupChk = '동일한 코드그룹을 사용중입니다.'

/*************************************************************
* 작성자 : 최정석
* 작성날짜 : 2025.08.08
* 내용 : 관리자 > 부서관리
**************************************************************/	

var adminUnitNmChk = '동일한 부서명을 사용중입니다.'
var adminUnitLvChk = '초기 화면에서는 1레벨 부서만 추가할 수 있습니다.'

